ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    output: "3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: FLOAT
        raw_data: "\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: FLOAT
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "0"
    input: "3"
    input: "4"
    output: "5"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 2
    data_type: FLOAT
    name: "1"
    raw_data: "\315\314\314=\315\314\314="
  }
  initializer {
    dims: 2
    data_type: FLOAT
    name: "2"
    raw_data: "fff?fff?"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "5"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 2
}
